{
  "series": {
    "name": "Introduction to Knot Theory",
    "speaker": "Seongjeong Kim",
    "affiliation": "Jilin University",
    "personalPage": "https://www.ktrt-seminars.com/",
    "mail": "kimseongjeong@jlu.edu.cn",
    "description": "Knot theory plays an important role in low-dimensional topology. Knots and links in Euclidean 3-space provide concrete and diagrammatic ways to encode topological information about 3- and 4-manifolds, and they have been used to study various problems in low-dimensional manifold theory. In this sense, knot theory serves as a bridge between low-dimensional topology and other areas of mathematics. <br><br> The goal of this lecture series is to provide a general introduction to knot theory and to explain how 3-manifolds can be described using knots and links. We will present several fundamental concepts, properties, and theorems, focusing on the main ideas rather than detailed proofs. <br><br> These talks are intended for researchers, graduate students, and advanced undergraduate students with a background in algebraic topology. No advanced prior knowledge of knot theory is required.",
    "about": "Dr. Seongjeong Kim is an associate professor in the department of mathematics, Jilin University. His research focuses on knot theory and low-dimensional topology. His main research topic is the classification of knots in 3-manifolds and its applications, which is related to low-dimensional manifold theory and topological quantum field theory.",
    "zoomLink": "https://iiitd-ac-in.zoom.us/j/98973225688?pwd=XhklapvhcYK1psmzGXtjCCgzFBmlFU.1",
    "meetingId": "989 7322 5688",
    "passcode": "1729",
    "references": []
  },
  "talks": [
    {
      "id": "SK-1",
      "title": "Basic notions of knot theory",
      "date": "2026-02-10",
      "time": "16:00 IST",
      "part": "Part 1",
      "recording": "https://youtu.be/hfHmsdZJ9wc",
      "notes": "/notes/Kim-Lecture_Notes-1.pdf",
      "abstract": "We introduce basic definitions and fundamental results in knot theory. One of the simplest knot invariants is the coloring invariant, which can detect certain nontrivial knots. As a generalization of the coloring invariant, we define an algebraic structure called a quandle."
    },
    {
      "id": "SK-2",
      "title": "Kauffman bracket and the colored Jones polynomial",
      "date": "2026-02-17",
      "time": "16:00 IST",
      "part": "Part 2",
      "recording": "",
      "notes": "",
      "abstract": "We introduce the Kauffman bracket and the Jones polynomial, which arise naturally in quantum topology and statistical mechanics. As an extension of the Jones polynomial, we also introduce the colored Jones polynomial."
    },
    {
      "id": "SK-3",
      "title": "Knot theory and low-dimensional topology",
      "date": "2026-02-24",
      "time": "16:00 IST",
      "part": "Part 3",
      "recording": "",
      "notes": "",
      "abstract": "The goal of this lecture is to explain how closed 3-manifolds can be constructed via surgery along framed links. We briefly review the notion of handle decompositions of manifolds and then describe how framed knots and links give rise to 3-manifolds."
    }
  ]
}