[
  {
    "id": "RSS-1",
    "title": "Overview of Some Concepts Related to Compact Kähler Manifolds (Prerequisites)",
    "speaker": "Rajas Sandeep Sompurkar",
    "personalPage": "https://sites.google.com/view/rajassompurkar/home",
    "date": "2025-08-27",
    "time": "16:00 IST",
    "series": "Existence of Higher Extremal Kähler Metrics on a Minimal Ruled Surface",
    "affiliation": "IISER Pune",
    "seriesDates": ["27 Aug", "03 Sep", "10 Sep"],
    "seriesLink": "/series/existence-of-higher-extremal-kahler-metrics-on-minimal-ruled-surface/",
    "zoomLink": "https://iiitd-ac-in.zoom.us/j/96806437264?pwd=epbbqZTAiLu3Dkbs8anDyVlseO3PI5.1",
    "meetingId": "968 0643 7264",
    "passcode": "1729",
    "description": "Based on the Research Paper: Existence of Higher Extremal Kähler Metrics on a Minimal Ruled Surface - Rajas Sandeep Sompurkar (Bull. Sci. Math., 2023)",
    "part": "Part 1",
    "recording": "https://youtu.be/Tl-m3pBgoKA",
    "notes": "/notes/Talk_1_Topo_Geo_IIIT_Delhi_Rajas.pdf",
    "abstract": "In this introductory talk we will briefly review the theory of complex manifolds and almost complex structures with a few standard examples. We will then introduce the notion of a Kähler manifold and see the relevance and importance of this notion. Things like the Chern connection on a compact Kähler manifold and the resultant notion of curvature will be explained briefly with the relevant mathematical expressions. Most notably we will discuss about the Ricci and scalar curvatures and the related notion of the first Chern class of a compact Kähler manifold. The notation and conventions for the rest of the series of talks will be set in this talk.",
    "about": "Rajas Sandeep Sompurkar completed his Ph.D. in Kähler Geometry and Geometric Analysis in November 2024 at the Indian Institute of Science (IISc), Bengaluru, under the guidance of Prof. Vamsi Pritham Pingali and Prof. Ved V. Datar. Since February 2025, he has been working as a Postdoctoral Fellow at the Indian Institute of Science Education and Research (IISER) Pune, mentored by Prof. Diganta Borah. His research focuses on canonical Kähler metrics on compact Kähler manifolds—such as Calabi’s extremal Kähler metrics, constant scalar curvature Kähler (cscK) metrics, and Kähler-Einstein metrics—and the associated Kähler geometric partial differential equations (PDEs) that naturally arise from the study of these metrics. For instance, the study of Kähler-Einstein metrics is directly linked to the complex Monge-Ampère equation."
  },
  {
    "id": "RSS-2",
    "title": "Overview of Some Concepts Related to Holomorphic Line Bundles (Prerequisites)",
    "speaker": "Rajas Sandeep Sompurkar",
    "personalPage": "https://sites.google.com/view/rajassompurkar/home",
    "date": "2025-09-03",
    "time": "14:30 IST",
    "series": "Existence of Higher Extremal Kähler Metrics on a Minimal Ruled Surface",
    "seriesLink": "/series/existence-of-higher-extremal-kahler-metrics-on-minimal-ruled-surface/",
    "zoomLink": "https://iiitd-ac-in.zoom.us/j/96806437264?pwd=epbbqZTAiLu3Dkbs8anDyVlseO3PI5.1",
    "meetingId": "968 0643 7264",
    "passcode": "1729",
    "description": "Based on the Research Paper: Existence of Higher Extremal Kähler Metrics on a Minimal Ruled Surface - Rajas Sandeep Sompurkar (Bull. Sci. Math., 2023)",
    "part": "Part 2",
    "recording": "",
    "notes": "",
    "abstract": "In this talk we will see the definition of a holomorphic vector bundle on a compact Kähler manifold and we will also see some of the properties of it. For the purpose of this series of talks we would be mostly interested in holomorphic line bundles (which are just rank one holomorphic vector bundles), but we will still see some standard examples like the holomorphic tangent and cotangent bundles and most importantly for us the canonical and anticanonical line bundles associated to any compact Kähler manifold. The notions of Ricci and scalar curvature for a compact Kähler manifold introduced in the previous talk will be reformulated here in terms of the curvature of the anticanonical line bundle."
  },
  {
    "id": "RSS-3",
    "title": "Existence of Higher Extremal Kähler Metrics on a Minimal Ruled Surface (Final Main Talk)",
    "speaker": "Rajas Sandeep Sompurkar",
    "personalPage": "https://sites.google.com/view/rajassompurkar/home",
    "date": "2025-09-10",
    "time": "14:30 IST",
    "series": "Existence of Higher Extremal Kähler Metrics on a Minimal Ruled Surface",
    "seriesLink": "/series/existence-of-higher-extremal-kahler-metrics-on-minimal-ruled-surface/",
    "zoomLink": "https://iiitd-ac-in.zoom.us/j/96806437264?pwd=epbbqZTAiLu3Dkbs8anDyVlseO3PI5.1",
    "meetingId": "968 0643 7264",
    "passcode": "1729",
    "description": "Based on the Research Paper: Existence of Higher Extremal Kähler Metrics on a Minimal Ruled Surface - Rajas Sandeep Sompurkar (Bull. Sci. Math., 2023)",
    "part": "Part 3",
    "recording": "",
    "notes": "",
    "abstract": "In this final talk our goal is to state the main results of the above mentioned research work. We will discuss about the various notions of canonical Kähler metrics on a compact Kähler manifold. These are roughly speaking Kähler metrics that satisfy some special curvature properties, and the three well-known and well-studied notions of canonical Kähler metrics are Kähler-Einstein metrics, constant scalar curvature Kähler (cscK) metrics and Calabi’s extremal Kähler metrics. We will define motivated by analogy the notions of higher cscK and higher extremal Kähler metrics introduced by Pingali, which are the main objects of study in our research work. We will give a brief description of the momentum construction method of Hwang-Singer which is used in our problem of finding explicit examples of higher extremal Kähler metrics. We will set this problem in its correct context and provide the relevant references for the same."
  }
]
